In [2]:
import pandas as pd

In [3]:
missingValues= pd.read_csv('sample_csv.txt')

In [3]:
missingValues

    electonic     grocery food-items  Price
0     mobiles  detergents    chicken   15.0
1    desktops      fruits   spagetti    NaN
2     laptops  vigitables      juice   30.0
3     tablets      drinks    spinach    NaN
4  headphones        toys      salad    NaN
5      router    medicine       rice   90.0

How to Handle the upper missing values in the Price col
method used is fillnan

In [4]:
missingValues['Price'].mean()

np.float64(45.0)

In [7]:
missingValues['Price']= missingValues['Price'].fillna(missingValues['Price'].mean())

In [8]:
missingValues

    electonic     grocery food-items  Price
0     mobiles  detergents    chicken   15.0
1    desktops      fruits   spagetti   45.0
2     laptops  vigitables      juice   30.0
3     tablets      drinks    spinach   45.0
4  headphones        toys      salad   45.0
5      router    medicine       rice   90.0

pandas can also drop the nan values: for example

In [4]:
#all the rows containing any nan wil be removed 
missingValues.dropna()

  electonic     grocery food-items  Price
0   mobiles  detergents    chicken   15.0
2   laptops  vigitables      juice   30.0
5    router    medicine       rice   90.0